{
    "current version": 0.3,
    "version": {
        "0.1": "10/15",
        "0.2": "10/16/2018",
        "0.3": "10/17/2018"
    },
    "animals": {
        "cats": [
            "The technical term for a cat’s hairball is a bezoar.",
            "There are cats who have survived falls from over 32 stories (320 meters) onto concrete.",
            "Owning a cat can reduce the risk of stroke and heart attack by a third.",
            "Wikipedia has a recording of a cat meowing, because why not?",
            "Adult cats only meow to communicate with humans.",
            "Peltaco's cat Hemingway is the worlds best cat.",
            "Cats can't taste sweetness.",
            "People who own cats have on average 2.1 pets per household, where dog owners have about 1.6.",
            "Cats are often lactose intolerant, so stop givin' them milk!",
            "Basically all cartoon cats lied to us: Raw fish is off the table for cats as well.",
            "The technical term for \"hairball\" is \"bezoar.\"",
            "Cats make more than 100 different sounds whereas dogs make around 10.",
            "A cat's brain is 90% similar to a human's — more similar than to a dog's.",
            "Cats and humans have nearly identical sections of the brain that control emotion.",
            "There are 45 Hemingway cats living at the author's former home in Key West, Fla.",
            "Cats use their whiskers to detect if they can fit through a space.",
            "Evidence suggests domesticated cats have been around since 3600 B.C.,2,000 years before Egypt's pharaohs.",
            "Every year, nearly four million cats are eaten in China as a delicacy.",
            "I don't know anything about cats.",
            "A cat can jump up to six times its length.",
            "Cats only sweat through their foot pads.",
            "Kangaroos can't hop backwards",
            "Here is a video of some cats in zero gravity. youtu.be/O9XtK6R1QAk",
            "Since cats treat us like cats and depend on us for things like food, water, and opening the door to let them out, they do recognize, that we are in some way in charge — the “big cat” in the shared territory. As territorial animals, our cats are constantly wondering why we’re not doing other cat things that the big cat would normally do in their territory. In fact, the “let me in, let me out, let me in” phenomenon is a good example. The bigger cat ostensibly rules the territory and therefore should be the one patrolling and marking it with pee so other cats stay away. But since humans don’t do this, indoor-outdoor cats reluctantly take on the role themselves. The apparent neuroticism of cats wanting to go outside every five minutes only to be let right back in is funny to us because it seems so silly and unnecessary. But to the cats, it’s very necessary (and frustrating) to cover for their dumb pals.",
            "In most US states, declawing cats is legal but in the European Union it is not.",
            "By the time a cat is 9 years old, it will only have been awake for three years of its life.",
            "A female cat is called a “molly” or a “queen”.",
            "Cats have fur",
            "Cats are the most popular pet in the United States: There are 88 million pet cats and 74 million dogs.",
            "In tigers and tabbies, the middle of the tongue is covered in backward-pointing spines, used for breaking off and gripping meat.",
            "The world's richest cat is worth $13 million after his human passed away and left her fortune to him.",
            "When cats grimace, they are usually \"taste-scenting.\" They have an extra organ that, with some breathing control, allows the cats to taste-sense the air.",
            "A cat's purr may be a form of self-healing, as it can be a sign of nervousness as well as contentment.",
            "Your cat recognizes your voice but just acts too cool to care (probably because they are).",
            "Cats have a longer-term memory than dogs, especially when they learn by actually doing rather than simply seeing.",
            "Polydactyl cats are also referred to as \"Hemingway cats\" because the author was so fond of them.",
            "When asked if her husband had any hobbies, Mary Todd Lincoln is said to have replied \"cats.\"",
            "Cats can change their meow to manipulate a human. They often imitate a human baby when they need food, for example.",
            "One legend claims that cats were created when a lion on Noah's Ark sneezed and two kittens came out.",
            "In Korea and Japan, there is a Cat Cafe where you can go to drink coffee and hang out with cats for hours.",
            "When cats leave their poop uncovered, it is a sign of aggression to let you know they don't fear you.",
            "Owning a cat can reduce the risk of heart attacks and strokes by more than a third, researchers found.",
            "Cats \"knead\" because of seperation from their mothers",
            "Your cat's instincts tell her that a paperweight or knickknack could turn out to be a mouse. Her poking paw would send it scurrying, giving her a good game. This is probably why cats always seem to be knocking the glasses off your counter tops!",
            "The fear of cats is called \"Ailurophobia\"",
            "Black cats are less likely to be adopted because of their \"appearance\".",
            "Due to the controversy, though loved by most, the Kashmir is overlooked by many cat fanciers.",
            "Cats can survive falls from up to 65 feet or more.",
            "The goddess of love, beauty, and fertility in Norse mythology, Freyja was the first cat lady. She is depicted in stories as riding a chariot that was drawn by cats.",
            "Cat owners are 25% likely to pick George Harrison as their favorite Beatle.",
            "Only 11.5% of people consider themselves \"cat people\".",
            "\"Cat people\" are 11% more likely to be introverted than others.",
            "The Egyptian Mau is the oldest breed of cat, and is the fastest pedigreed cat.",
            "Cats were mythic symbols of divinity in ancient Egypt.",
            "The place where Julius Caesar was murdered is now a cat sanctuary.",
            "The Bombay cat breed was developed to resemble a miniature panther.",
            "Cats use their whiskers to judge whether they’ll fit through a space.",
            "Kittens sleep so much because the growth hormone is only released when they sleep.",
            "For a cat at rest, the average heart rate usually is between 150 and 180 bpm, more than twice that of a human, which averages 70 bpm.",
            "Compared to other felines, domestic cats have narrowly spaced canine teeth, adapted to their preferred prey of small rodents.",
            "Cats, like dogs, are digitigrades. They walk directly on their toes, with the bones of their feet making up the lower part of the visible leg.",
            "The domestic cat (Felis catus) is a small, typically furry, carnivorous mammal.",
            "A cat's kidneys are so efficient, it can survive on a diet consisting only of meat, with no additional water, and can even rehydrate by drinking seawater.",
            "Most breeds of cat have a noted fondness for settling in high places, or perching. In the wild, a higher place may serve as a concealed site from which to hunt.",
            "The ability of a cat to reflexively twist its body and balance itself during a fall is known as the \"cat righting reflex\".",
            "Cats have 38 chromosomes in each zygote cell.",
            "Cucumbers look enough like a snake to cause a cat's instinctive fear of snakes to kick in, causing it to panic and flee.",
            "The cat's tongue has backwards-facing spines about 500 μm long, which are called papillae. These contain keratin which makes them rigid so the papillae act like a hairbrush.",
            "Among domestic cats, males are more likely to fight than females.",
            "The softest part of a cat is most definitely its cheek area.",
            "Hank the Cat was a Maine Coon feline that was put up as a joke candidate in the 2012 United States Senate election in Virginia, a feat which gained international coverage after Hank reportedly came third behind the two major candidates, including Vice Presidential candidate Tim Kaine.",
            "When a cat yawns, it's mouth opens so wide that you can count every tooth.",
            "A cat can die from essential oils",
            "Cats can move their ears 180 degrees.",
            "Hearing is the strongest of cat's senses: They can hear sounds as high as 64 kHz — compared with humans, who can hear only as high as 20 kHz.",
            "Cats have free-floating clavicle bones that attach their shoulders to their forelimbs, which allows them to squeeze through very small spaces.",
            "Lil' Bunny Sue Roux is a cat who was born with no front legs, and walks upright like a kangaroo. https: //www.instagram.com/lilbunnysueroux",
            "Blackie became the richest cat in history when he inherited 15 million British Pounds.",
            "Towser \"The Mouser\" of Glenturret Distillery in Crieff, Scotland, holds the Guinness World Record for the most mice caught (28,899).",
            "A cat can’t climb head first down a tree because every claw on a cat’s paw points the same way. To get down from a tree, a cat must back down.",
            "The cat who holds the record for the longest non-fatal fall is Andy. He fell from the 16th floor of an apartment building (about 200 ft/.06 km) and survived.",
            "Cats have about 130,000 hairs per square inch (20,155 hairs per square centimeter).",
            "A cat’s eyesight is both better and worse than humans. It is better because cats can see in much dimmer light and they have a wider peripheral view. It’s worse because they don’t see color as well as humans do. Scientists believe grass appears red to cats.",
            "If they have ample water, cats can tolerate temperatures up to 133 °F.",
            "The lightest cat on record is a blue point Himalayan called Tinker Toy, who weighed 1 pound, 6 ounces (616 g). Tinker Toy was 2.75 inches (7 cm) tall and 7.5 inches (19 cm) long.",
            "Many Egyptians worshipped the goddess Bast, who had a woman’s body and a cat’s head.",
            "The first cartoon cat was Felix the Cat in 1919. In 1940, Tom and Jerry starred in the first theatrical cartoon “Puss Gets the Boot.” In 1981 Andrew Lloyd Weber created the musical Cats, based on T.S. Eliot’s Old Possum’s Book of Practical Cats.",
            "Approximately 1/3 of cat owners think their pets are able to read their minds.",
            "The claws on the cat’s back paws aren’t as sharp as the claws on the front paws because the claws in the back don’t retract and, consequently, become worn.",
            "Like humans, cats tend to favor one paw over another.",
            "The most traveled cat is Hamlet, who escaped from his carrier while on a flight. He hid for seven weeks behind a panel on the airplane. By the time he was discovered, he had traveled nearly 373,000 miles (600,000 km).",
            "Approximately 40,000 people are bitten by cats in the U.S. annually.",
            "The little tufts of hair in a cat’s ear that help keep out dirt direct sounds into the ear, and insulate the ears are called \"ear furnishings.\"",
            "The special sensory organ called the Jacobson's organ allows a cat to have 14 times the sense of smell of a human. It consists of two fluid-filled sacs that connect to the cat's nasal cavity and is located on the roof of their mouth behind their teeth.",
            "The Australian Wildlife Conservancy completed a 44km cat-proof fence in 2018 to prevent feral cats from entering the Newhaven wildlife sanctuary, who kill about a million native birds every night across Australia and have caused the extinction of 20 native species.",
            "Black cats are bad luck in the United States, but they are good luck in the United Kingdom and Australia.",
            "The cat skull is unusual among mammals in having very large eye sockets and a powerful and specialized jaw.",
            "Cats have scent glands along their tail, their forehead, lips, chin, and the underside of their front paws.",
            "The french tuxedo kitty, Félix, aka \"Astrocat\", was the first cat to go to space. She survived the trip.",
            "A male cat is called a tom.",
            "In 1879, Belgium unsuccessfully tried to use cats to deliver mail.",
            "Issac Newton decided to invent the cat flap because his own cat, Spithead, kept opening the door and spoiling his light experiments.",
            "Kittens start to dream when they’re about a week old.",
            "Thank to an extremely efficient pair of kidneys, cats can hydrate themselves by drinking salt water.",
            "A cats whiskers are the exact width of their body.",
            "At night, Disneyland is overrun by cats. The theme park feeds them and takes care of them though, because they keep the rodent population in check.",
            "Cats lack antibodies against dog blood so they can only receive it via a transfusion once. The second time would kill them.",
            "The Indiana State Prison allows prisoners to adopt a cat and keep it in their cell. They are meant to improve the mood of the prisoners.",
            "In Islam, cats are revered for their cleanliness. Muhammad is reported to have said that \"a love of cats is an aspect of faith\".",
            "Oftentimes shelters won't let black cats be adopted around Halloween out of a fear that they may be sacrificed.",
            "When cats bring dead animals back to their humans, they are \"teaching them to hunt\" as they would with a younger cat.",
            "Scottish sailer Alexander Selkirk once survived for 4 years on a deserted island thanks to feral cats that protected him from large rats during the night.",
            "A cat named Emmy lived aboard the RMS Empress of Ireland and she never missed a voyage. On May 28,1914, however, she refused to board. The ship left without her and then sank the following day.",
            "Domestic cats will try not to drink from a water bowl that is next to their food. This is because in the wild, water next to their kill could be contaminated.",
            "Koko the gorilla got a pet cat for her birthday in 1985 after she requested to have one as a birthday present.",
            "The Egyptian Mau’s name is derived from the Middle Egyptian word mjw, which means cat. But contrary to its name, it’s unclear whether the modern Egyptian Mau actually originated in Egypt.",
            "Cat fanciers bred and exhibited Maus in Europe until World War II, when attention toward the cat waned and it nearly went extinct.",
            "The myth that a cat has nine lives comes from their ability to jump and land from high places. The number 9 is believed by some to originate from William Shakespeare's Romeo and Juliet: \"A cat has nine lives. For three he plays, for three he strays, and for the last three he stays.\"",
            "A Chinese cat named Baidianr (meaning \"white spot\") had a unique ability to choose World Cup winners. He predicted the winner of the soccer competition 6 years in a row, before he died on June 2, 2018, just before the event ended.",
            "Cats have a layer called the tapetum lucidum just behind their retina which reflects light inside the eye, helping it capture more light. This reflected light is the glow you see when taking a photo of a cat with the flash on.",
            "Parker's cat is a Maine Coon and weights 20 pounds.",
            "Unlike kittens, adult cats don’t release any particular key hormones during sleep. They snooze all day just because they can. :)",
            "Russian scientists discovered in the 1930s that Siamese kittens kept in very warm rooms didn't develop the breed's signature dark patches.",
            "Cats have a third eyelid called a “haw”. It’s generally only visible when they’re unwell.",
            "Cats aren’t the only animals that purr — squirrels, lemurs, elephants, and even gorillas purr too.",
            "In the original Italian version of Cinderella, the benevolent fairy godmother figure was a cat.",
            "A cat was mayor of Talkeetna, Alaska, for 20 years. His name is Stubbs, and he died on July 23, 2017.",
            "Black cat is called shadow"
        ],
        "dogs": [
            "Puppies love games such as hide and seek! Hide, then call your pup's name so she can try to find you.",
            "Dogs can learn more than 1000 words.",
            "Big happy \"helicopter\" tail wagging is one sign of a really nice dog",
            "Upright, stiff, rapid tail movement is not wagging or \"friendly\" but indicates a dog who's rather excited and focused.",
            "Puppies grow to half their body weight in the first four to five months!",
            "Puppies then take a year or more to gain the other half of their body weight.",
            "Puppies can sleep 18 to 20 hours a day during that rapid body growth phase.",
            "Dogs sometimes appear to smile -- much like humans -- with open mouth grinning. This may indicate a relaxed, submissive state.",
            "Tired puppies get cranky just like little kids. If you have a fussy puppy, try nap time.",
            "The fastest breed, the Greyhound, can run up to 44 miles per hour.",
            "Perky-eared dogs hear sounds better than floppy-eared dogs.",
            "There are about 400 million dogs in the world.",
            "The Labrador Retriever is the most popular breed, according to the American Kennel Club.",
            "The Labrador Retriever is the most popular breed, according to the American Kennel Club.",
            "There are hundreds of breeds of dogs.",
            "The average dog lives 10 to 14 years.",
            "In general, smaller breeds live longer than larger breeds.",
            "The world's oldest breed, the Saluki, originated in Egypt around 329 B.C.",
            "According to a study shared by Cornell University, dogs were domesticated between 9,000 and 34,000 years ago.",
            "Thomas Jefferson helped enact a dog tax in Virginia, because he was annoyed that dogs were killing his sheep.",
            "Stroking dogs and gazing into their eyes releases the \"feel good\" hormone oxytocin for both people and dogs.",
            "Dogs are omnivores -- they eat meat, grains and vegetables.",
            "The heaviest breed, the Mastiff, weighs about 200 pounds.",
            "More than half of all U.S. presidents have owned dogs.",
            "President Calvin Coolidge owned at least a dozen dogs.",
            "Just like human fingerprints, no two dogs' nose prints are alike.",
            "At about 6 inches, the Chihuahua is the shortest breed.",
            "Irish Wolfhounds, the tallest breed, are 30 to 35 inches tall.",
            "A Russian dog named Laika was the first animal in space, traveling around Earth in 1957.",
            "Dogs who bark the most: Miniature Schnauzers, Cairn Terriers, Yorkshire Terriers, Fox Terriers and West Highland White Terriers.",
            "Puppies have 28 teeth and adult dogs have 42.",
            "The best age to bring a puppy home is 8 to 12 weeks.",
            "Dogs can see best at dawn and dusk.",
            "Dogs aren't colorblind but their eyes don't have receptors for red. They see in shades of black and white and also in shades of blue and yellow.",
            "New puppies have heat sensors in their noses to help find their moms while their eyes and ears are closed.",
            "A dog's sense of smell is reduced by up to 40 percent when he's overheated and panting.",
            "Highly trainable dog breeds like Golden Retrievers, Labrador Retrievers, German Shepherds and Collies are more kid-friendly than some other breeds.",
            "Bichons, Portuguese Water Dogs, Kerry Blue Terriers, Maltese and Poodles are all good choices if you have allergies since they shed less than other breeds.",
            "More than one in three U.S. families owns a dog.",
            "The average number of puppies in a litter is four to six.",
            "There are nearly 14,000 animal shelters and rescue groups across North America.",
            "Service dogs are recognized in the U.S. as \"necessary medical equipment.\"",
            "Therapy dogs, who bring healing to individuals and families by visiting hospitals,schools or retirement homes, differ from service dogs, who assist individuals who have disabilities.",
            "The Newfoundland has a water-resistant coat and webbed feet.",
            "As Disney's Cruella De Vil was aware, Dalmatian puppies are born pure white and develop spots as they grow older.",
            "Dogs sweat through the pads of their feet.",
            "Dogs have three eyelids, including one to keep their eyes moist and protected.",
            "Chow Chows are born with pink tongues, which turn blue-black at 8 to 10 weeks.",
            "Dogs are pack animals -- they don't enjoy being alone.",
            "In ancient China, people kept warm by putting dogs up their sleeves.",
            "Dogs who have been spayed or neutered live longer than intact dogs.",
            "A bloodhoubnd named Tigger holds the record for the longest ears, each measuring more than 13 inches.",
            "Bingo is the name of the dog on the box of Cracker Jacks.",
            "In 1969, Lassie was the first animal inducted into the Animal Hall of Fame.",
            "The Alaskan Malamute can withstand temperatures as low as 70 degrees below zero.",
            "Petting a dog can lower your blood pressure.",
            "Stray dogs in Moscow have learned to ride the subway to find food.",
            "Over half of dog owners include their dogs in annual holiday photos.",
            "Although it was once illegal to keep dogs as pets in Iceland's capital city, the laws have been relaxed.",
            "President Lyndon Johnson's beagles were named Him and Her.",
            "One unspayed female dog, her mate and their puppies can produce 67,000 puppies in six years.",
            "The Basenji is the only barkless dog.",
            "Dogs are direct descendants of wolves.",
            "Puppies are blind, deaf and toothless when born.",
            "Dogs curl up to keep themselves warm and protect vital organs.",
            "A dog's sense of smell is 10,000 times stronger than a human's.",
            "The Norwegian Lundehund is the only dog with six toes on each foot.",
            "Dogs can get jealous when their humans display affection toward someone or something else.",
            "Dogs can be trained to detect cancer and other diseases in humans.",
            "A dog's whiskers are used as sensing devices.",
            "Three of the 12 dogs on the Titanic survived.",
            "Your pup reaches his full size between 12 and 24 months.",
            "The U.S. has the highest dog population in the world.",
            "Rin Tin Tin was the first Hollywood dog star.",
            "A dog's average body temperature is 101.2 degrees.",
            "Many foot disorders in dogs are caused by long toenails.",
            "The Boy Scouts and Girl Scouts both offer merit badges in dog care.",
            "The Berger Picard, Miniature American Shepherd and Lagotto Romagnolo are the newest dog breeds recognized by the American Kennel Club in 2015.",
            "Paul McCartney of the Beatles recorded a high pitched whistle at the end of \"A Day in the Life\" for his dog.",
            "Max, Jake, Maggie and Molly are the most popular dog names.",
            "Spiked dog collars were used to protect dogs' throats from wolf attacks in ancient Greece.",
            "Walt Disney's family dog -- named Sunnee -- was the inspiration behind \"Lady and the Tramp.\"",
            "Walt Disney's family dog -- named Sunnee -- was the inspiration behind \"Lady and the Tramp.\"",
            "Teams of dogs compete for the fastest time without errors in Flyball races.",
            "A German Shepherd named Orient accompanied her blind owner Bill Irwin as he became the first blind person to through-hike the 2,100-mile Appalachian Trail in 1990.",
            "Chihuahuas are born with soft spots in their skulls, just like human babies.",
            "Mastiffs wore armor and were sent after mounted knights in Roman times.",
            "National Geographic's Dr. Brady Barr measured a dog's average bite force at 320 pounds of pressure per square inch.",
            "Dogs are mentioned in the Bible more than 35 times.",
            "Obesity is the top health problem among dogs.",
            "Dachshunds were originally bred to fight badgers.",
            "President Theodore Roosevelt's Bull Terrier Pete ripped the pants off French Ambassador Jules Jusserand.",
            "The Border Collie, Poodle and Golden Retriever are considered the world's smartest dog breeds.",
            "Smaller breeds of dogs mature faster than larger breeds.",
            "Dogs have twice as many muscles to move their ears as humans, if you're looking for unusual facts about dogs!",
            "Female dogs carry puppies for about nine weeks before birth.",
            "Dogs are naturally submissive to any creature with a higher pack status.",
            "The Chihuahua was named for the state in northwestern Mexico where they were discovered.",
            "Dogs can be taught to count and solve simple math problems.",
            "With love and a little patience, dogs can learn to walk backwards, salute and bow.",
            "Pit bulls have been given a bad rap. BADRAP was started in the San Francisco Bay area on behalf of \"pit bulls and their people\" and was ranked nationally as a No. 1 high-impact nonprofit for animal welfare.",
            "Revolutionary War soldiers sometimes brought their dogs with them into battle. Such was the case with George Washington and his dog, Sweetlips.",
            "The American Water Spaniel was the first hunting breed developed to retrieve from boats."
        ],
        "bunny": [
            "It may seem random but every bunny LOVES bananas !! It's like candy for them !! They may prefer it over every treat in the world.",
            "Cats say meow! Dogs say woof! But bunnies can make noises too! Growls and squeaks and even a low hum-like sound that means the bunny is really happy!!",
            "Rabbits and bunnies are the same animal – there’s no difference in breed or species, just the word we prefer.",
            "Rabbits and hares are “lagomorphs”, an order that also includes the pika, a small burrowing mammal that looks like a large mouse and lives in colder climates.",
            "Lagomorphs were originally classified as rodents, but in 1912 the distinction was made between them and rodents.",
            "Hares are born with their eyes open, hair covering their bodies, and they can run within a few minutes of birth (much like a Guinea pig!).  Rabbits, on the other hand, are born blind, naked, and remain in a fur-lined nest for the first days of their lives.",
            "Jackrabbits, which belong to the genus “Lepus,” have been clocked at speeds of 45 miles per hour.",
            "Stories abound about the prolific reproductive nature of rabbits and so it is not surprising that the rabbit should have become a symbol of fertility in many cultures and religions.  As the Christian influence spread, this symbol became associated with Easter.",
            "Rabbits are meticulously clean animals and are easy to house break and train.  Much like a dog, a pet rabbit can be taught to come to his/her name, sit in your lap, and do simple tricks.",
            "Happy rabbits practice a cute behavior known as a “binky:” they jump up in the air and twist and spin around!",
            "A baby rabbit is called a kit, a female is called a doe, and a male is a buck.  A group of rabbits is called a herd.",
            "Rabbits are herbivores, eating a diet entirely of grasses and other plants.  Because their diet contains so much cellulose, they pass twodifferent kinds of feces to completely break down their food.  While other grazers will chew and swallow their feed, then “burp” it back up (as cows chew cud), rabbits will re-ingest their feces on the first pass to get all of the nutrients they need.",
            "The average size of a rabbit litter is usually between 4 and 12 babies, which results after a short 30-day gestation.  Male rabbits can reproduce as early as 7 months of age, and females as early as 4 months.  This means in one year a single female rabbit can produce as many as 800 children, grandchildren, and great-grandchildren!",
            "A rabbit’s life span is about 8 years, though sterilized rabbits (those who are spayed/neutered) can live as long as 10-12 years.",
            "A rabbit’s teeth never stop growing!  Many people believe they need to chew to keep their teeth short.  While they do enjoy chewing, it’s the normal wear from where their top and bottom teeth meet that keeps a rabbit’s teeth short.",
            "Can you guess what other domestic animal is similar to rabbits?  A horse!  They have similar eyes, teeth, and ears (those belonging to many prey animals), as well as a similar diet and behavior.  Clearly, their size is much different…",
            "A rabbit symbol is often used to show that a product was not tested on animals.  This is because rabbits have traditionally been used in product safety testing.",
            "Bunnies cannot vomit, so it is super important to feed them only healthy, fresh, appropriate food."
        ]
    },
    "math": {
        "pi": [
            "Pi is the most recognized mathematical constant in the world. Scholars often consider Pi the most important and intriguing number in all of mathematics.",
            "The symbol for pi (π) has been used regularly in its mathematical sense only for the past 250 years",
            "Scientists in Carl Sagan’s novel Contact are able to unravel enough of pi to find hidden messages from the creators of the human race, allowing humans to access deeper levels of universal awareness",
            "In the Star Trek episode “Wolf in the Fold,” Spock foils the evil computer by commanding it to “compute to last digit the value of pi.",
            "Egyptologists and followers of mysticism have been fascinated for centuries by the fact that the Great Pyramid at Giza seems to approximate pi. The vertical height of the pyramid has the same relationship to the perimeter of its base as the radius of a circle has to its circumference",
            "We can never truly measure the circumference or the area of a circle because we can never truly know the value of pi. Pi is an irrational number, meaning its digits go on forever in a seemingly random sequence",
            "Darren Aronofsky’s fascinating movie π (Pi: Faith in Chaos) shows how the main character’s attempt to find simple answers about pi (and, by extension, the universe) drives him mad. The film won the Directing Award at the 1988 Sundance Film Festival.",
            "In the Greek alphabet, π (piwas) is the sixteenth letter. In the English alphabet, p is also the sixteenth letter",
            "The letter π is the first letter of the Greek word “periphery” and “perimeter.” The symbol π in mathematics represents the ratio of a circle’s circumference to its diameter. In other words, π is the number of times a circle’s diameter will fit around its circumference",
            "If the circumference of the earth were calculated using π rounded to only the ninth decimal place, an error of no more than one quarter of an inch in 25,000 miles would result",
            "n 1995, Hiroyoki Gotu memorized 42,195 places of pi and is considered the current pi champion. Some scholars speculate that Japanese is better suited than other languages for memorizing sequences of numbers.",
            "The first 144 digits of pi add up to 666 (which many scholars say is “the mark of the Beast”). And 144 = (6+6) x (6+6)",
            "During the famed O.J. Simpson trial, there were arguments between defense attorney Robert Blasier and an FBI agent about the actual value of pi, seemingly to reveal flaws in the FBI agent’s intellectual acumen",
            "A mysterious 2008 crop circle in Britain shows a coded image representing the first 10 digits of pi",
            "Ludolph van Ceulen (1540-1610) spent most of his life calculating the first 36 digits of pi (which were named the Ludolphine Number). According to legend, these numbers were engraved on his now lost tombstone",
            "William Shanks (1812-1882) worked for years by hand to find the first 707 digits of pi. Unfortunately, he made a mistake after the 527th place and, consequently, the following digits were all wrong",
            "In 2002, a Japanese scientist found 1.24 trillion digits of pi using a powerful computer called the Hitachi SR 8000, breaking all previous records",
            "Pi is the secret code in Alfred Hitchcock’s Torn Curtain and in The Net starring Sandra Bullock",
            "Since there are 360 degrees in a circle and pi is intimately connected with the circle, some mathematicians were delighted to discover that the number 360 is at the 359th digit position of pi",
            "Umberto Eco’s famed book Foucault’s Pendulum associates the mysterious pendulum in the novel with the intrigue of pi.",
            "Pi has been studied by the human race for almost 4,000 years. By 2000 B.C., Babylonians established the constant circle ratio as 3-1/8 or 3.125. The ancient Egyptians arrived at a slightly different value of 3-1/7 or 3.143.",
            "One of the earliest known records of pi was written by an Egyptian scribe named Ahmes (c. 1650 B.C.) on what is now known as the Rhind Papyrus. He was off by less than 1% of the modern approximation of pi (3.141592)",
            "The Rhind Papyrus (c. 1650 B.C.) was the first attempt to calculate pi by “squaring the circle,” which is to measure the diameter of a circle by building a square inside the circle",
            "The “squaring the circle” method of understanding pi has fascinated mathematicians because traditionally the circle represents the infinite, immeasurable, and even spiritual world while the square represents the manifest, measurable, and comprehensive world",
            "Computing pi is a stress test for a computer—a kind of “digital cardiogram",
            "A Givenchy men’s cologne named Pi is marketed as highlighting the sexual appeal of intelligent and visionary men",
            "In 1888, a Indiana country doctor named Edwin Goodwin claimed he had been “supernaturally taught” the exact measure of the circle and even had a bill proposed in the Indiana legislature that would copyright his mathematical findings. The bill never became law thanks to a mathematical professor in the legislature who pointed out that the method resulted in an incorrect value of pi",
            "The first million decimal places of pi consist of 99,959 zeros, 99,758 1s, 100,026 2s, 100,229 3s, 100,230 4s, 100,359 5s, 99,548 6s, 99,800 7s, 99,985 8s, and 100,106 9s",
            "The Bible alludes to pi in 1 Kings 7:23 where it describes the altar inside Solomon’s temple: “And he made a molten sea of ten cubits from brim to brim . . . and a line of thirty cubits did compass it round about.” Some scholars interpret this to mean that the value of pi is 3.",
            "Pi was first rigorously calculated by one of the greatest mathematicians of the ancient world, Archimedes of Syracuse (287-212 B.C.). Archimedes was so engrossed in his work that he did not notice that Roman soldiers had taken the Greek city of Syracuse. When a Roman soldier approached him, he yelled in Greek “Do not touch my circles!” The Roman soldier simply cut off his head and went on his business",
            "A refined value of pi was obtained by the Chinese much earlier than in the West. The Chinese had two advantages over most of the world: they used decimal notations and they used a symbol for zero. European mathematicians would not use a symbolic zero until the late Middle Ages through contact with Indian and Arabic thinkers",
            "Al-Khwarizmi, who lived in Baghdad around A.D. 800, worked on a value of pi calculated to four digits: 3.1416. The term “algorithm” derives from his name, and his text Kitab al-Jabr wal-Muqabala (The Book of Completion Concerning Calculating by Transposition and Reduction) gives us the word “algebra” (from al-Jabr, which means “completion” or “restoration”)",
            "Ancient mathematicians tried to compute pi by inscribing polygons with more and more sides that would more closely approach the area of a circle. Archimedes used a 96-sided polygon. Chinese mathematician Liu Hui inscribed a 192-sided polygon and then a 3,072-sided polygon to calculate pi to 3.14159. Tsu Ch’ung and his son inscribed polygons with as many as 24,576 sides to calculate pi (the result had only an 8-millionth of 1% difference from the now accepted value of pi)",
            "Comedian John Evans once quipped: “What do you get if you divide the circumference of a jack-o’-lantern by its diameter? Pumpkin π.",
            "William Jones (1675-1749) introduced the symbol “π” for pi in 1706, and it was later popularized by Leonhard Euler (1707-1783) in 1737",
            "The π symbol came into standard use in the 1700s, the Arabs invented the decimal system in A.D. 1000, and the equal sign (=) appeared in 1557",
            "Before the π symbol was used, mathematicians would describe pi in round-about ways such as “quantitas, in quam cum multipliectur diameter, proveniet circumferential,” which means “the quantity which, when the diameter is multiplied by it, yields the circumference.”",
            "Leonardo da Vinci (1452-1519) and artist Albrecht Durer (1471-1528) both briefly worked on “squaring the circle,” or approximating pi.",
            "There are no occurrences of the sequence 123456 in the first million digits of pi—but of the eight 12345s that do occur, three are followed by another 5. The sequence 012345 occurs twice and, in both cases, it is followed by another 5.",
            "Some scholars claim that humans are programmed to find patterns in the world because it’s the only way we can give meaning to the world and ourselves. Hence, the obsessive search to find patterns in π.",
            "The father of calculus (meaning “pebble used in counting” from calx or “limestone”), Isaac Newton calculated pi to at least 16 decimal places.",
            "Pi is also referred to as the “circular constant,” “Archimedes’ constant,” or “Ludolph’s number.”",
            "In the seventeenth century, pi was freed from the circle and applied also to curves, such as arches and hypocycloids, when it was found that their areas could also be expressed in terms of pi. In the twentieth century, pi has been used in many areas, such as number theory, probability, and chaos theory.",
            "The first six digits of pi (314159) appear in order at least six times among the first 10 million decimal places of pi",
            "\"Pi Day\" is celebrated on March 14 (which was chosen because it resembles 3.14). The official celebration begins at 1:59 p.m., to make an appropriate 3.14159 when combined with the date. Albert Einstein was born on Pi Day (3/14/1879) in Ulm Wurttemberg, Germany.",
            "Thirty-nine decimal places of pi suffice for computing the circumference of a circle girding the known universe with an error no greater than the radius of a hydrogen atom.",
            "John Donne’s (1572-1631) poem “Upon the Translations of the Psalms by Sir Philip Sidney, and the Countess of Pembroke, His Sister” condemns attempts to find an exact value of pi, or to “square a circle,” which Donne views as an attempt to rationalize God",
            "Many mathematicians claim that it is more correct to say that a circle has an infinite number of corners than to view a circle as being cornerless",
            "Plato (427-348 B.C.) supposedly obtained for his day a fairly accurate value for pi: √2 + √3 = 3.146",
            "A website titled “The Pi-Search Page” finds a person’s birthday and other well known numbers in the digits of pi."
        ]
    }
}
